basic/controllers/ArticleController.php

INSERT INTO `article` (`title`, `slug`, `body`, `created_at`, `updated_at`, `created_by`) VALUES ('temp1', 'temp1', 'dsafasdfijadhs ufhdifhcdjivnadsj', 1648450323, 1648450323, 12)
---
    public function actionCreate()
    {
        $model = new Article();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `article` WHERE `slug`='yii3'
---
    protected function findModel($slug)
    {
        if (($model = Article::findOne(['slug' => $slug])) !== null) {