basic/models/SignupForm.php

INSERT INTO `user` (`username`, `auth_key`, `access_token`, `password`) VALUES ('benjamin', '0jmYfQZTUGBnXuEL7to1FH9MVgFvTXLt', 'Y4xxbML17vwZ3azsQOWtgaBr-Mrj6J7h', 'benjamin')
---
    public function signup()
    {
        $user = new User();
        $user->username = $this->username;
        $user->auth_key = \Yii::$app->security->generateRandomString();
        $user->access_token = \Yii::$app->security->generateRandomString();
       // $user->password = \Yii::$app->security->generatePasswordHash($this->password);
       $user->password = $this->password;

        if ($user->save()){