basic/models/User.php

SELECT * FROM `user` WHERE `username`='benjamin'
---
    public static function findByUsername($username)
    {
        return User::find()->where(['username' => $username])->one();